instagram_clone/app/controllers/comments_controller.rb

  def create
    @picture = Picture.find(params[:comment][:picture_id])

    @comment = @picture.comments.build(comments_params)
    @comment.user_id = current_user.id

    if @comment.save
---
SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
INSERT INTO "comments" ("message", "user_id", "picture_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["message", "Yes geez"], ["user_id", 12], ["picture_id", 8], ["created_at", "2020-06-07 20:12:50.905470"], ["updated_at", "2020-06-07 20:12:50.905470"]]

  def destroy
    @comment = Comment.find(params[:comment][:id])
    @user_of_picture = @comment.picture.user_id

    @comment.destroy
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 7]]