instagram_clone/app/controllers/pictures_controller.rb

  def create
    @picture = current_user.pictures.build(picture_params)
    p "Picture Object => #{@picture.inspect}"
    p "Params: #{params}"

    if @picture.save
---
INSERT INTO "pictures" ("text", "created_at", "updated_at", "image", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["text", "wefwef"], ["created_at", "2020-06-07 12:00:32.281320"], ["updated_at", "2020-06-07 12:00:32.281320"], ["image", "gun.png"], ["user_id", 12]]

  def destroy
    Picture.find(params[:picture][:id]).destroy
---
DELETE FROM "pictures" WHERE "pictures"."id" = $1  [["id", 4]]
SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]