instagram_clone/app/controllers/users_controller.rb

  def create
    # Get a user object from user params
    @user = User.new(user_params)

    # Check if user object can be 'saved' to the database
    if @user.save
---
INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"